{
  "products": [
    {
      "id": 1,
      "name": "Laptop",
      "price": 999.99,
      "image": "https://i0.wp.com/www.alphr.com/wp-content/uploads/2022/03/How-to-Find-the-Model-Number-on-a-Laptop.jpg?fit=2000%2C1125&ssl=1",
      "description": "This high-performance laptop features the latest Intel Core i7 processor and 16GB of RAM, ensuring smooth multitasking and superior gaming performance. With a stunning 15.6-inch Full HD display and advanced graphics card, it delivers vibrant visuals for movies and gaming alike. Its sleek and lightweight design makes it easy to carry, while the long-lasting battery ensures you can work or play for hours without interruption."
    },
    {
      "id": 2,
      "name": "Smartphone",
      "price": 599.99,
      "image": "https://www.cnet.com/a/img/resize/690ad0a97cf8fc98f3cf851e7b149d2ffc5b171e/hub/2023/05/04/31dfdcf2-1ac3-4320-b40c-4c356300f06e/google-pixel-7a-phone-14.jpg?auto=webp&height=500",
      "description": "Experience the power of the latest smartphone with a stunning 6.1-inch OLED display and a powerful Snapdragon 7 processor. Equipped with a dual-camera system, it captures stunning photos and videos even in low light conditions. Enjoy up to 128GB of storage for all your apps, photos, and music. The device also supports fast charging, ensuring that you're always ready to go without waiting long."
    },
    {
      "id": 3,
      "name": "Headphones",
      "price": 149.99,
      "image": "https://images.herzindagi.info/image/2024/Jan/best-gaming-Headphones-1.jpg",
      "description": "Enjoy an immersive audio experience with these wireless headphones that offer exceptional sound quality and comfort. Featuring adaptive noise cancellation technology, you can focus on your music or games without distractions. The cushioned ear cups and adjustable headband ensure a comfortable fit for long listening sessions, while the built-in microphone allows for clear calls. With a battery life of up to 30 hours, you can enjoy your favorite tunes all day long."
    },
    {
      "id": 4,
      "name": "Mouse",
      "price": 149.99,
      "image": "https://dlcdnwebimgs.asus.com/gain/640C2121-97E6-4880-B56E-AAF63DAE53A6/w750/h470",
      "description": "Elevate your gaming experience with this high-precision gaming mouse that features customizable buttons and RGB lighting. The ergonomic design ensures comfort during long gaming sessions, while the high-DPI sensor provides rapid response times for competitive play. With adjustable weight settings, you can customize the mouse to your preference, ensuring optimal performance whether you're navigating complex gaming environments or working on creative projects."
    },
    {
      "id": 5,
      "name": "Keyboard",
      "price": 149.99,
      "image": "https://www.cnet.com/a/img/resize/1b990bf2917a4d2a220ea2be6bb39e8eaca7d125/hub/2021/08/20/453e37bf-61cb-4e16-ad90-fd822bdc390a/keychron-k3-mechanical-keyboard.jpg?auto=webp&fit=crop&height=576&width=768",
      "description": "This compact mechanical keyboard is designed for both gamers and professionals, featuring customizable RGB backlighting and responsive key switches for a satisfying typing experience. Its slim profile and lightweight design make it perfect for on-the-go use, while the Bluetooth connectivity allows you to connect up to three devices seamlessly. The long-lasting battery means you won't have to recharge frequently, allowing you to focus on your work or gaming without interruption."
    },
    {
      "id": 6,
      "name": "Monitor",
      "price": 149.99,
      "image": "https://www.digitaltrends.com/wp-content/uploads/2022/12/ROG-Swift-OLED-PG27AQDM_-Scenario.jpg?fit=720%2C720&p=1",
      "description": "This high-resolution monitor offers stunning visuals with its 27-inch OLED display, delivering deep blacks and vibrant colors that bring your games and media to life. Featuring a 144Hz refresh rate and 1ms response time, it's perfect for competitive gaming, providing smooth and lag-free visuals. With adjustable stand height and tilt, you can customize your viewing experience for optimal comfort and productivity, whether you're working or playing."
    },
    {
      "id": 7,
      "name": "Speaker",
      "price": 149.99,
      "image": "https://stereoplus.com/cdn/shop/files/775136_5_600x.jpg?v=1692816394",
      "description": "This portable speaker delivers powerful sound quality with deep bass and crystal-clear highs. Its compact design makes it easy to carry, making it an ideal companion for outdoor adventures or parties. The speaker features Bluetooth connectivity, allowing you to stream music wirelessly from your devices, and its long-lasting battery ensures you can enjoy up to 12 hours of continuous playtime. Built-in waterproofing means you don't have to worry about spills or splashes during use."
    }
  ]
}
